<!-- 2章　Hello World -->

<?php
// PHPの研修カリキュラム2-1
?>

<?php
// PHPの
// 研修カリキュラム
// 2-1
?>

<html>
    <p>I say that <?php echo "Hello World!"; ?></p>
</html>

<?php
echo "【IT用語　SESに向けて準備しよう】";
echo "<br>";
echo "1.開発環境・検証環境・本番環境" . "<br>";
echo "開発環境とは、現在開発しているパソコンの環境、複数人で作業をしている場合は、コード統合開発環境も含む。" . "<br>" . "検証環境とは、開発後リリース予定の機能をテストするための環境のこと。" . "<br>" . "本番環境とは、システムが製品として実際に稼働している環境のこと。" . "<br>";
echo "2.基本設計書・詳細設計書" . "<br>";
echo "基本設計書とは、要件定義に基づいてシステムの概要を考える作業のこと。(業務フロー、機能一覧表、ネットワークの構成、DBのテーブル定義、DBのER図(要素同士の関連を示す)の作成、画面イメージ、帳票イメージ)" . "<br>" . "詳細設計書とは、基本設計を基に実際のプログラムが作れるようにシステムの詳細を考える作業のこと。" . "<br>";
echo "3.Ajax" . "<br>";
echo "Ajax(Asynchronous JavaScript + XML)とは、サーバとのやりとりが可能なJavaScriptの非同期通信を使って、XML形式のデータをWebサーバからもらってくる実装方式のこと。" . "<br>";
?>